<a href="https://colab.research.google.com/github/ibrahimtatarlar/ibo/blob/master/Copy_of_Week6_Sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction

[SQL](https://en.wikipedia.org/wiki/SQL) (Structured Query Language, pronounced "sequel" or ess-cue-ell) is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is particularly useful in handling structured data where there are relations between different entities/variables of the data. SQL is a very important tool for data scientists to have in their repertoire. 

A relational database is, simply, a database that stores related information across multiple tables and allows you to query information in more than one table at the same time. Within a table, the data to be stored is organized in a tabular format with rows and columns. Each row inside a table represents a distinct record with the column headings specifying the corresponding type of data stored. Software that is used to manage a digital database is called a Database Management System (DBMS). There are quite a few database systems available (such as MySQL, PostgreSQL, IBM Db2 and Oracle Database, etc.). The Web site [DB-Engines](http://dbengines.com/en/ranking/relational+dbms) collects and presents information on DBMSs and provides a monthly listing of them, ranked by their current popularity. You’ll likely find yourself using many different types of databases throughout your education and work. However, all of them speak SQL, so once you've got the hang of the basic SQL syntax you'll be able to work with any of them.

To keep things simple, we will be using a database system called [SQLite](https://www.sqlite.org/about.html) to practice SQL syntax. SQLite is an in-process library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine. Unlike most other SQL databases, SQLite does not have a separate server process. SQLite reads and writes directly to ordinary disk files. A complete SQL database with multiple tables, indices, triggers, and views, is contained in a single disk file. It is the most widely deployed database in the world. But every technology has a trade-off. Because it has no server managing access to it, it fails in multiuser environments where multiple people can simultaneously edit the SQLite file.

There are several ways to query a SQLite database with python such as sqlite3 and SQLAlchemy. However, we use **[ipython-sql](https://github.com/catherinedevlin/ipython-sql)** Magic functions to query a sqllite database as it is more straightforward and concise. ipython-sql introduces a %sql (or %%sql) magic to notebooks allowing you to connect to a database, using SQLAlchemy connect strings, then issue SQL commands within IPython or [Jupyter](http://jupyter.org/)/IPython Notebook. However, if you do not use the %%sql magic in your Jupyter notebook, the output of your SQL queries will be just a plain list of tuples. A better way to work with the result sets returned is to draw them as a table with the headers. This is where the IPython SQL magic gets very handy.

You can install it using ***pip install ipython-sql*** or ***conda install ipython-sql***. The ipython-sql library is loaded using the %load_ext just like other iPython extension syntax. 

#### Advantages of Using SQL (Rahul, 2018)

- It is standardized
>no matter which relational database you choose, it will have an SQL query interpreter built in. The sheer popularity of SQL makes it worth everyone’s time who interacts with a data system.

- It has a reasonable English-like syntax. 
>None of the painstaking detail of programming languages like C or Java have to be specified when using SQL. It is concise, easy to understand, and easy to write database queries with. It is declarative in nature, meaning you only have to declare what you want to achieve rather than going over the steps to achieve the results.
- It allows a uniform way to query and administer a relational database. 
>Many of the database administration commands are standard SQL commands making the transfer of skills much easier.
- It is mature – SQL has been around for over 35 years.
>While many new features have been added to it, the core of SQL has largely been unchanged. You can derive
a lot of utility knowing a few basic SQL concepts and commands, and they will serve you well into the future.

However, please keep it mind that while it is similar across DBMS, there are subtle differences. These differences result from different interpretations of the standard, different development styles, or different underlying architectures. In practice, refer to their techinical documents for details.


### References

SQL Primer: An Accelerated Introduction to SQL Basics by Rahul Batra. Rahul Batra (2018). https://doi.org/10.1007/978-1-4842-3576-8_7

Effective SQL: 61 Specific Ways to Write Better SQL by by John L. Viescas, Douglas J. Steele, Ben G. Clothier (2016). ISBN-13: 978-0134578897.

https://www.sqlite.org/about.html

https://github.com/catherinedevlin/ipython-sql

https://en.wikipedia.org/wiki/SQL

http://jupyter.org/

In [0]:
from google.colab import drive
drive.mount('/content/gdrive')

In [0]:
# %load_ext sql

# import sqlite3
# conn = sqlite3.connect(":memory:")
# cur = conn.cursor()
# cur.execute("SELECT 1 as 'Test' ")
# print(cur.fetchone())

In [0]:
# cur.execute('''CREATE TABLE stocks
#              (date text, trans text, symbol text, qty real, price real)''')

In [0]:
# cur.execute('SELECT * FROM stocks')
# print(cur.fetchone())

# # Larger example that inserts many records at a time
# purchases = [('2006-03-28', 'BUY', 'IBM', 1000, 45.00),
#              ('2006-04-05', 'BUY', 'MSFT', 1000, 72.00),
#              ('2006-04-06', 'SELL', 'IBM', 500, 53.00),
#             ]
# cur.executemany('INSERT INTO stocks VALUES (?,?,?,?,?)', purchases)

In [0]:
# for row in cur.execute('SELECT * FROM stocks ORDER BY price'):
#         print(row)

# Quick Start

This quick start is a complete example to show how to
- create a SQLite database; 
- creat a data table;
- insert data into the table;
- query data from the table.

In [17]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Create a SQLite Database

For practice purposes, it's advisable to create your own database, so that you are free to perform any operations on it. If using the SQLite shell, we can apply the ***open*** command to both create a SQLite database or open it in case it already exists just like:

> sqlite> .open testdb

Similaryly, we can use ipython-sql to the same thing:

In [18]:
%sql sqlite:///writers.db3

u'Connected: @writers.db3'

### Create a table

***%%sql*** let you use multiple SQL statements inside a single cell. 

It is now time to create one using a standard SQL command – CREATE TABLE. If the table already existed in the database, an error will pop up. In addition, we set ***PRIMARY KEY*** on USERID to prevent from inserting duplicate writers into the table.

In [19]:
%%sql sqlite://
CREATE TABLE writer(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,  
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

(sqlite3.OperationalError) table writer already exists
[SQL: CREATE TABLE writer(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,
    USERID int  NOT NULL UNIQUE,
    PRIMARY KEY (USERID)
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Add data to the table

The table we have just created is empty. Now we insert some sample data inside it. To populate this data in the form of rows, we use the command INSERT.

In [20]:
%%sql sqlite://
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Lin', 'Han', 1996);
INSERT INTO writer VALUES ('Peter', 'Brecht', 1978);

IntegrityError: ignored

### Write the First Query

Let us now turn our attention to writing a simple query to check the results of our previous operations in which we created a table and inserted three rows of data into it. For this, we would use the command called SELECT.

we can put the query result into a variable such as the following sqlres.

In [6]:
sqlres = %sql SELECT * from writer
sqlres

 * sqlite:///writers.db3
Done.

[(u'William', u'Shakespeare', 1616),
 (u'Lin', u'Han', 1996),
 (u'Peter', u'Brecht', 1978)]

You also can select the specific colummns using their names just like:

In [7]:
sqlres = %sql SELECT FirstName, LastName from writer
sqlres

 * sqlite:///writers.db3
Done.

[(u'William', u'Shakespeare'), (u'Lin', u'Han'), (u'Peter', u'Brecht')]

# ex02-Query Table Information

This notebook will show how to query the number of tables and a table'columns given a database using the powerful **SELECT**.

In [21]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Connet to the given database of demo.db3

In [22]:
%sql sqlite:///demo.db3

u'Connected: @demo.db3'

### List  tables in a database

Table and index names can be list by doing a **SELECT** on a special table named "***SQLITE_MASTER***". Every SQLite database has an SQLITE_MASTER table that defines the schema for the database. For tables, the ***type*** field will always be '***table***' and the name field will be the name of the table. So to get a list of all tables in the database, use the following SELECT command:

See more at https://www.sqlite.org/faq.html#q7.

In [25]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///demo.db3
   sqlite:///writers.db3
Done.

[]

### List columns in a table

We take the table of rch as an example

In [0]:
%sql sqlite://
%sql select * from writer where 1=0

#### :) We get the table information just using SELECT * with key work of LIMIT

You can try to change the limit number to 1, 2 to check the results.

In [0]:
%sql select * from writer LIMIT 3



#### Or directly use select *

***Warning***! This table may contains too many records. It'd better not query all of them.

In [0]:
%sql select * from writer

# ex03-Retrieving Data with SELECT

When working with databases and SQL, the most common task is to request data from one or more tables, which returns this data in the form of a result table. These result tables are called result-sets. The ***SELECT*** statement accomplishes this. In most applications, ***SELECT*** is the most commonly used data query language (DQL) command. Moreover, the ***SELECT*** can do far more than simply retrieve and display data and I will show you in the following sections.

***SELECT Syntax***

- *SELECT column1, column2, columnN FROM table_name;*

Here, column1, column2... are the fields (or columns) of a table (table_name).

However, if you want query all records, just use:
- SELECT * FROM table_name;

In [9]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### 1. Connet to the given database of demo.db3

In [0]:
%sql sqlite:///demo.db3

If you do not remember the tables in the demo data, you can always use the follow command to query. Here we select the table of watershed_yearly as an example.

In [33]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///demo.db3
   sqlite:///writers.db3
Done.

[]

### 2. Retrieving all data

As we alreay know, the most common SQL operation is a SELECT statement, which pulls data from a table and then displays the results. Let’s write our first SQL statement.

In [34]:
%sql SELECT * From watershed_yearly

 * sqlite:///demo.db3
   sqlite:///writers.db3
(sqlite3.OperationalError) no such table: watershed_yearly
[SQL: SELECT * From watershed_yearly]
(Background on this error at: http://sqlalche.me/e/e3q8)

### 3. Retrieving data from specific columns

In many cases, it is not necessary to pull all columns in a SELECT statement. You can also pick and choose only the columns you are interested in. The following query will only pull the ***YR***, ***PREC_mm*** and ***PET_mm*** columns:

In [0]:
%sql SELECT YR, PREC_mm, PET_mm From watershed_yearly

### 4. Do some calculations in SELECT Statements

:) The SELECT statement can do far more than simply select columns. 

Sometimes, we are also intersted in the relationship between columns. This can be done with expressions in SELECT Statements. For example, I'd like to see the difference between ***PREC_mm*** and ***PET_mm*** columns (using the minus operator **-**). You can also try other operators such as +, *, / or %.

In [36]:
%sql SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm From watershed_yearly

 * sqlite:///demo.db3
   sqlite:///writers.db3
(sqlite3.OperationalError) no such table: watershed_yearly
[SQL: SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm From watershed_yearly]
(Background on this error at: http://sqlalche.me/e/e3q8)

It is amazing, is'nt it? However, the exmpression is presented as a new column name. It is not that beautiful.
***It is quite easy for us to give it a new name using an AS statement (this is known as an alias).***

In [37]:
%sql SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly

 * sqlite:///demo.db3
   sqlite:///writers.db3
(sqlite3.OperationalError) no such table: watershed_yearly
[SQL: SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly]
(Background on this error at: http://sqlalche.me/e/e3q8)

Besides giving names to expressions using aliases, aliases can also be used to rename an existing column within the query. For example, we rename ***PREC_mm*** to ***Precipitation_mm***.

***However, keep in mind that such an operatation does not affect the real data or change the name in the table.It only change the way you see it on your screen.*** You can always try SELECT * From watershed_yearly to see the truth.

In [38]:
%sql SELECT YR, PREC_mm as Precipitation_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly

 * sqlite:///demo.db3
   sqlite:///writers.db3
(sqlite3.OperationalError) no such table: watershed_yearly
[SQL: SELECT YR, PREC_mm as Precipitation_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly]
(Background on this error at: http://sqlalche.me/e/e3q8)

# ex04-Constrain the Number of Rows Returned by a SELECT Query

Often it is not convenient to show all rows on screen as you have to scroll. We can use use SQLite ***LIMIT*** clause to constrain the number of rows returned by a query. This can be used for testing or to prevent consuming excessive resources if the query returns more information than expected.

The following illustrates the syntax of the LIMIT clause:
- SELECT column_list FROM table_name LIMIT row_count;

In [0]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [39]:
%sql sqlite:///data/demo.db3

(sqlite3.OperationalError) unable to open database file
(Background on this error at: http://sqlalche.me/e/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: ['sqlite:///demo.db3', 'sqlite:///writers.db3']

### 2. Retrieving the first 10 rows of the table of watershed_yearly

Add the LIMIT clause to the SELECT statement to get exact 10 rows.

In [40]:
%sql SELECT * From watershed_yearly LIMIT 10

 * sqlite:///demo.db3
   sqlite:///writers.db3
(sqlite3.OperationalError) no such table: watershed_yearly
[SQL: SELECT * From watershed_yearly LIMIT 10]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Note

Some DBMSs offer non-standard syntax either instead of or in addition to SQL standard syntax. Variants of the simple ***limit*** query for different DBMSes can be found at https://en.wikipedia.org/wiki/Select_(SQL)

# ex05-Filtering a Query with WHERE

Sometimes, you’ll want to only check the rows returned by a query, where one or more columns meet certain criteria. This can be done with a WHERE statement. The WHERE clause is an optional clause of the SELECT statement. It appears after the FROM clause as the following statement:
>SELECT column_list FROM table_name WHERE search_condition;

In [44]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### 1. Connet to the given database of demo.db3

In [42]:
%sql sqlite:///data/demo.db3

(sqlite3.OperationalError) unable to open database file
(Background on this error at: http://sqlalche.me/e/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: ['sqlite:///demo.db3', 'sqlite:///writers.db3']

If you do not remember the tables in the demo data, you can always use the follow command to query. Here we select the table of watershed_yearly as an example.

In [43]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///demo.db3
   sqlite:///writers.db3
Done.

[]

### 2. Retrieving data with WHERE

Take the table of ***rch*** as an example.

#### 2.1 Check the table colums firstly.

In [0]:
%sql SELECT * From rch LIMIT 5

#### 2.2 Check the number of rows

There should be 8280 rows. This can be done with the SQLite ***COUNT*** function. We will touch other SQLite function over the next few notebooks.

In [0]:
%sql SELECT COUNT(*) as nrow From rch

#### 2.3 Use WHERE to retrieve data

Let’s say we are interested in records for only the year 1981. Using a WHERE is pretty straightforward for a simple criterion like this.

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR=1981

#### 2.4 use *AND* to further filter data

There are 23 RCHs. We are only intersted in the 10th RCH. We can add another filter condition with an ***AND*** statement.

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR=1981 AND RCH=10

#### 2.5 More combinations of filters

We also can further filter data with the operators of ***!=*** or ***<>*** to get data except 1981.

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR<>1981 and RCH=10 and MO=6

We can further filter the data to spefic months using ***OR*** statement. For example, we'd like check the data in the months of 3, 6 and 9. However, we have to use ***()*** to make them as one condition.:) It is a trick. You can try!

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and (MO=3 or MO=6 or MO=9 or MO=12)

Or we can simplify the above filter using the ***IN*** statement.

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and MO in (3, 6, 9, 12)

Or the months are ***NOT*** in 3, 6, 9, 12

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and MO NOT IN (3,6,9,12)

#### 2.6 Filter with math operators

For example,  we could use the modulus operator (%) to filter the MOs.

In [0]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and MO % 3 = 0

### Summary

In the WHERE statement, we can the combinations of ***NOT, IN, <>, !=, >=, >, <, <=, AND, OR, ()*** and even some of math operators (such as %, *, /, +, -)to retrieve the data we want easily and efficiently.

# ex06-Doing Math Across Table Columns

As we already know, the demo database (i.e., demo.db3) was extraced from a numerical hydrological modeling. The major data types are of integers, decimals, or floating points. It is quite natural that we want to carry out some calculations or statistical analysis. SQL can handle calculations ranging from basic math through advanced statistics.

***Basic Math Operators***
<li>+ Addition
<li>- Subtraction
<li>* Multiplication
<li>/ Division (returns the quotient only, no remainder)
<li>% Modulo (returns just the remainder)
<li>^ Exponentiation
<li>Others 
    
Let’s try to use the most frequently used SQL math operators on the demo data. Instead of using numbers in queries, we’ll use the names of the columns that contain the numbers. When we execute the query, the calculation will occur on each row of the table.

In [0]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [0]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the following command to query.

In [0]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. Test Math Operator in an easy way

Using the SELECT statement, we can easily test the math operators.

In [0]:
%sql SELECT 3+4

In [0]:
%sql SELECT 12 * 4

In [0]:
%sql SELECT 12 % 4

In [0]:
%sql SELECT round(123.456,2) as Rounded

### 3. Doing Math Across Table Columns

Take the table of watershed_monthly as an example

#### 3.1 Check the table colums firstly.

In [0]:
%sql SELECT * From watershed_monthly LIMIT 3

#### 3.2 Calculate the difference between two colummns

For example, we are interested in the difference between Potential evapotranspiration (PET_mm) and precipitation (PREC_mm). It is so-called Potential evapotranspiration deficit (PED). PED can be thought of as a drought index. It is the difference between how much water could potentially be lost from the soil through evapotranspiration and how much is actually available. When PED is high, plants do not have the full amount of water available they need for growth.

In [0]:
%%sql sqlite://
SELECT YR, MO,  
PREC_mm as Precipitation, 
PET_mm as PET, 
PET_mm-PREC_mm as PED 
From watershed_monthly LIMIT 10

###### We also can calculate the PED ratio to Precipitation.

In [0]:
%%sql sqlite://
SELECT YR, MO,  PREC_mm as Precipitation, 
PET_mm as PET, 
(PET_mm-PREC_mm)/PREC_mm*100.0 as PED_Ratio 
From watershed_monthly LIMIT 10

#### 3.3 Use math operators in a WHERE statement

For example, we could use the modulus operator (%) to filter the MOs.

In [0]:
%%sql sqlite://
SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms 
From rch 
WHERE YR>2009 
and RCH=10 
and MO % 3 = 0

### 4. Do some statistics with Aggregate Functions

So far, we’ve performed math operations across columns in each row of a table. We also can calculate a result from values within the same column using aggregate function, which calculate a single result from multiple inputs. Two of the most-used aggregate functions in data analysis are avg() and sum().

#### 4.1 average

avg - calculates the average of all values in that column (omits null values).

In [0]:
%%sql sqlite://
SELECT avg(FLOW_INcms), avg(FLOW_OUTcms) 
From rch

#### 4.2 sum

sum - calculates the sum of the values in that column (omits null values).

In [0]:
%%sql sqlite://
SELECT sum(FLOW_INcms), sum(FLOW_OUTcms) 
From rch

#### 4.3 extreme values

max - calculates the maximum value in that column (omits null values).

min - calculates the minimum value in that column (omits null values).

In [0]:
%%sql sqlite://
SELECT min(FLOW_INcms), max(FLOW_OUTcms) 
From rch

### 5. Calculate by ourselves

We can calculated some values by the combination of those math operators. For example, we can calculate the average values of Flow_In and Flow_Out.

In [0]:
%%sql sqlite://
SELECT sum(FLOW_INcms)/COUNT(FLOW_INcms) as AVG_FlowIn, 
sum(FLOW_OUTcms)/COUNT(FLOW_OUTcms) as AVG_FlowOut
From rch

### Summary

Aggregating data (also referred to as rolling up, summarizing, or grouping data) is creating some sort of total from a number of records. Sum, min, max, count, and average are common aggregate operations.

In fact, the above example did not present the real power of these aggregation functions. They will become more powerful only when they are used with ***GROUP BY*** and ***ORDER BY*** clauses.

## ex07-Aggregating data with GROUP BY and ORDER BY

The ***GROUP BY*** clause is an optional clause of the SELECT statement. The GROUP BY clause a selected group of rows into summary rows by values of one or more columns. 

The GROUP BY clause returns one row for each group. For each group, you can apply an aggregate function such as ***MIN, MAX, SUM, COUNT, or AVG*** to provide more information about each group.

In [0]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [0]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the following command to query.

In [0]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. Grouping data

Take the table of ***rch*** as an example

#### 2.1 Check the table colums firstly.

In [0]:
%sql SELECT * From rch LIMIT 3

#### 2.2 Check unique values

Firstly, let's have a look at the number of RCH. We can use the ***DISTINCT*** keyword in conjunction with SELECT statement to eliminate all the duplicate records and fetching only the unique records.

In [0]:
%%sql sqlite://
SELECT COUNT(DISTINCT RCH) AS nRCH
FROM rch

We also can use the ***GROUP BY*** clause to get back a cleaner output, with fewer rows – only unique values returned.

In [0]:
%%sql sqlite://
SELECT RCH
FROM rch
GROUP BY RCH

#### 2.3 Use aggregate  functions on Groups

We can get more details trough aggregating data on group than on whole columns.

In [0]:
%%sql sqlite://
SELECT RCH, AVG(FLOW_INcms), AVG(FLOW_OUTcms)
FROM rch
GROUP BY RCH

### 3. Order/Sort Records

Firstly, let us check the years and months with the maximum FLOW_INcms

In [0]:
%%sql sqlite://
SELECT RCH, YR, MO, MAX(FLOW_INcms)
FROM rch
GROUP BY RCH

It is obvious that the year and month columns are not in a natural sort. This is a good time to bring up the ***ORDER BY*** operator, which you can put at the end of a SQL state‐ment (after any WHERE and GROUP BY). We can sort the query results by year, and then month.

In [0]:
%%sql sqlite://
SELECT RCH, YR, MO, ROUND(MAX(FLOW_INcms),2)
FROM rch
GROUP BY RCH
ORDER BY YR, MO

By default, sorting is done with the ***ASC*** operator, which orders the data in ascending order. We can sort in descending order applying the ***DESC*** operatorhe.

In [0]:
%%sql sqlite://
SELECT RCH, YR, MO, ROUND(MAX(FLOW_INcms),2)
FROM rch
GROUP BY RCH
ORDER BY YR DESC, MO

### 4. Filter data on groups with the HAVING clause

Sometimes, we may want to filter out records based on a group or an aggregated value. While the first instinct might be to use a WHERE statement, this actually will not work because the WHERE filters records, and does not filter aggregations. For example, we try to use a WHERE to filter results where MAX(FLOW_INcms) is greater than 3000. This will get a sqlite3.OperationalError of misuse of aggregate.

In [0]:
%%sql sqlite://
SELECT RCH, YR, MO, MAX(FLOW_INcms) as MAX_FLOWIN
FROM rch
WHERE MAX_FLOWIN > 3000.0
GROUP BY RCH
ORDER BY YR DESC, MO

Under such a case, we cab use the ***HAVING*** clause to specify a filter condition for a group or an aggregate. The HAVING clause is an optional clause of the SELECT statement. We often use the HAVING clause with the GROUP BY clause. The GROUP BY clause groups a set of rows into a set of summary rows or groups. Then the HAVING clause filters groups based on specified conditions. 

***It is worth noting that the HAVING clause must follow the GROUP BY cluase strictly.***

In [0]:
%%sql sqlite://
SELECT RCH, YR, MO, MAX(FLOW_INcms) as MAX_FLOWIN
FROM rch
GROUP BY RCH
HAVING MAX_FLOWIN > 3000.0
ORDER BY YR DESC, MO

### Summary

In this notebook, we learned how to use the DISTINCT operator to get distinct results in our queries and eliminate duplicates.

Next, we learned how to aggregate and sort data using GROUP BY and ORDER BY. 

We also showed the power of the aggregate functions of SUM(), MAX(), MIN(), AVG(), and COUNT(). 

Furthermore, we used the HAVING clause to filter aggregated fields that can not be done with the WHERE clause.

## ex08-Joining Tables

When we design an entire database system using good design principles like normalization, different aspects of the information need to be separated into normalized tables. Under such a case, we often require the use of ***joins*** to retrieve data from multiple tables in a single SELECT query. Two tables can be joined by a single join operator, but the result can be joined again with other tables. There must exist a same or similar column between the tables being joined.

To connect tables in a query, we use a ***JOIN ... ON*** statement. There are different types of SQLite joins:
- INNER JOIN (or sometimes called simple join)
- LEFT OUTER JOIN (or sometimes called LEFT JOIN)
- CROSS JOIN

The RIGHT OUTER JOIN and FULL OUTER JOIN are not supported in SQLite.

In [0]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [0]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the following command to query.

In [0]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. INNER JOIN

The INNER JOIN allows us to merge two tables together. But if we are going to merge tables, we need to define a commonality between the two so records from both tables line up. We need to define one or more fields they have in common and join on them.

#### 2.1 Chek common columns

Here we take the tables of ***rch*** and ***sub*** as an example. There are three commom columns of RCH/SUB, YR and MO.

In [0]:
%sql SELECT * From rch LIMIT 3

In [0]:
%sql SELECT * From sub LIMIT 3

#### 2.2 Make an inner join

The syntax for the INNER JOIN in SQLite is:
>SELECT columns<br>
>FROM table1<br> 
>INNER JOIN table2<br>
>ON table1.column = table2.column;

Join on RCH/SUB, YR and MO. 

***Note***: When SELECTing the common columns, have to clearly asign a table'name. If column names or table names are too long, we can use aliases to give them short names.

In [0]:
%%sql sqlite://
SELECT RCH, rch.YR, rch.MO, FLOW_INcms, FLOW_OUTcms, PRECIPmm, PETmm
FROM rch INNER JOIN sub
ON rch.RCH = sub.SUB and rch.YR=sub.YR and rch.MO=sub.MO
LIMIT 5

### 3. LEFT JOIN

Similar to the INNER JOIN clause, the LEFT JOIN clause is an optional clause of the SELECT statement. You use the LEFT JOIN clause to query data from multiple correlated tables. This type of join returns all rows from the LEFT-hand table specified in the ON condition and only those rows from the other table where the joined fields are equal (join condition is met).

The syntax for the SQLite LEFT OUTER JOIN is:
>SELECT columns<br>
>FROM table1<br>
>LEFT [OUTER] JOIN table2<br>
>ON table1.column = table2.column;

In [0]:
%%sql sqlite://
SELECT RCH, rch.YR, rch.MO, FLOW_INcms, FLOW_OUTcms, PRECIPmm, PETmm
FROM rch LEFT JOIN sub
ON rch.RCH = sub.SUB and rch.YR=sub.YR and rch.MO=sub.MO
LIMIT 5

### 4. CROSS JOIN

Another type of join is called a SQLite CROSS JOIN. This type of join returns a combined result set with every row from the first table matched with every row from the second table. This is also called a Cartesian Product.

The syntax for the SQLite CROSS JOIN is:
>SELECT columns<br>
>FROM table1<br>
>CROSS JOIN table2;

In [0]:
%%sql sqlite://
SELECT RCH, rch.YR, rch.MO, FLOW_INcms, FLOW_OUTcms, PRECIPmm, PETmm
FROM rch
CROSS JOIN sub
LIMIT 5

### 5. Querying Multiple Tables Using JOIN

Relational databases can be fairly complex in terms of relationships between tables. Sometimes, we have to require information from more than two tables.

We can use the following syntax to join multiple tables:
>SELECT columns<br>
>FROM table1<br>
>INNER JOIN table2 ON table1.column = table2.column<br>
>INNER JOIN table3 ON table1.column = table3.column<br>
>...<br>
>INNER JOIN tablen ON table1.column = tablen.column;

There is no limit of maximum number of tables you can join according to SQL itself. However, most DBMSes have their own limits. You should check your DBMSes docs in practical applications. In addition, the query will will slow down considerably when joining too many tables (e.g., 4 or more tables).

### Summary

In this notebook, we practices the three major join types in SQLite: INNER, LEFT and CROSS joins. Joins allow us to take data scattered across multiple tables and stitch it together into something more meaningful and descriptive. We can take two or more tables and join them together into a larger table that has more context. Moreover, using aliases enables us to rename column or table names on the fly.

## ex09-Advanced Query Techniques of CASE and Subquery

The SQLite CASE expression evaluates a list of conditions and returns an expression based on the result of the evaluation. The CASE expression is similar to the IF-THEN-ELSE statement in other programming languages. You can use the CASE statement in any clause or statement that accepts a valid expression. For example, you can use the CASE statement in clauses such as WHERE, ORDER BY, HAVING, IN, SELECT and statements such as SELECT, UPDATE, and DELETE. See more at http://www.sqlitetutorial.net/sqlite-case/. 

A subquery, simply put, is a query written as a part of a bigger statement. Think of it as a SELECT statement inside another one. The result of the inner SELECT can then be used in the outer query.

In this notebook, we put these two query techniques together to calculate seasonal runoff from year-month data in the table of rch.

In [0]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [0]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the following command to query.

In [0]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. Chek the rch table

We can find that the rch table contains time series data with year and month for each river reach. Therefore, it is natural to calculate some seasonal statistics.

In [0]:
%sql SELECT * From rch LIMIT 3

### 3. Calculate Seasonal Runoff

There are two key steps: 
>(1) use the CASE and Subquery to convert months to named seasons;<br>
>(2) calculate seasonal mean with aggregate functions on groups.

In addition, we also use another filter keyword of ***BETWEEN*** to span months into seasons.

In [0]:
%%sql sqlite://
SELECT RCH, Quarter, AVG(FLOW_OUTcms) as Runoff
FROM(
SELECT RCH, YR, 
CASE 
    WHEN (MO) BETWEEN 3 AND 5 THEN 'MAM'   
    WHEN (MO) BETWEEN 6 and 8 THEN 'JJA'
    WHEN (MO) BETWEEN 9 and 11 THEN 'SON'
    ELSE 'DJF' 
END Quarter,
FLOW_OUTcms
from rch)
GROUP BY RCH, Quarter

### Summary

Sometimes, we may need construct complicated requires that go beyond a table join or basic SELECT query. For example, we might need to write a query that uses the results of other queries as inputs (i.e., SUBQUERY). Or we might need to reclassify numerical values into categories before counting them (i.e., CASE). 

In this notebook, we explored a collection of SQL functions and options essential for solving more complex problems. Now we can add subqueries in multiple locations to provide finer control over filtering or preprocessing data before analyzing it in a main query.

## ex10-Using Views to Simplify Queries


One of the beautiful aspects of the relational data model and SQL is that the output of a query is also a table, a relation to be precise. It may consist of a single column or a single row, but it is a table nonetheless. A view is a query that can be used like a table. A view can be considered as a virtual table that does not hold data. They just hold a query. Every time a view is accessed, the query underlying it is run and the returned results can be used as though they made up an actual table.

There are [several reasons](http://www.sqlitetutorial.net/sqlite-create-view/) for using veiws. I think the utmost reason is we are lazy and we do not want to write the same complicated long query sentences every time. :) I am kidding. However, keep in mind the DRY programming principle: Don’t Repeat Yourself. Avoiding repetition saves time and prevents unnecessary mistakes. This is one of right reasons that we save queries as reusable database views.

SQLite views are created using the CREATE VIEW statement. SQLite views can be created from a single table, multiple tables, or another view. Following is the basic [CREATE VIEW syntax](http://www.sqlitetutorial.net/sqlite-create-view/):
>CREATE [TEMP | TEMPORARY] VIEW view_name AS<br>
>SELECT column1, column2.....<br>
>FROM table_name<br>
>WHERE [condition];

SQLite view is read only. It means you cannot use INSERT, DELETE, and UPDATE statement to update data in the base tables through the view.

In [0]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [0]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the following command to query.

In [0]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. Simplifying queries with views

In the previous notebook, we used CASE and Subquery to calculate seasonal runoff from the table of rch. Here we use a view to simplify the calculation.

#### 2.1 Have a recall of how to calculate season runoffs

In [0]:
%%sql sqlite://
SELECT RCH, Quarter, AVG(FLOW_OUTcms) as Runoff
FROM(
SELECT RCH, YR, 
CASE 
    WHEN (MO) BETWEEN 3 AND 5 THEN 'MAM'   
    WHEN (MO) BETWEEN 6 and 8 THEN 'JJA'
    WHEN (MO) BETWEEN 9 and 11 THEN 'SON'
    ELSE 'DJF' 
END Quarter,
FLOW_OUTcms
from rch)
GROUP BY RCH, Quarter
LIMIT 5

#### 2.2 Creating a view

In [0]:
%%sql sqlite://
CREATE VIEW RCH_VW AS SELECT RCH, YR, 
CASE 
    WHEN (MO) BETWEEN 3 AND 5 THEN 'MAM'   
    WHEN (MO) BETWEEN 6 and 8 THEN 'JJA'
    WHEN (MO) BETWEEN 9 and 11 THEN 'SON'
    ELSE 'DJF' 
END Quarter,
FLOW_OUTcms
from rch

Let's query the SSN_RCH view

In [0]:
%%sql sqlite://
SELECT * 
FROM RCH_VW 
LIMIT 5

### 2.3 Recalculate seasonal runoffs with views

:) The codes really really get shorter.

In [0]:
%%sql sqlite://
SELECT RCH, Quarter, AVG(FLOW_OUTcms) as Runoff
FROM RCH_VW
GROUP BY RCH, Quarter
LIMIT 5

### 2.4 Deleting Views

It is quite easy to delete views. Just drop it like the following.

In [0]:
%sql DROP VIEW RCH_VW

### Summary

Views are virtual tables that do not hold data, only SQL statements. Those statements are executed each time the view is accessed. Because views are created dynamically as they are accessed and the data in those views are always fresh and up-to-date, they have some advantages over creating a subtables from a table. The data in subtables is static and could be out-to-date.

A view is useful in some [cases](http://www.sqlitetutorial.net/sqlite-create-view/):
- First, views provide an abstraction layer over tables. You can add and remove the columns in the view without touching the schema of the underlying tables.
- Second, you can use views to encapsulate complex queries with joins to simplify the data access.

## ex11-Dealing with NULL Values

The example data in the tables in the demo.db3 shown earlier are all accurate and complete. Every row has a value for each attribute. However, real data is usually not so clean and tidy. You will often find NULL values in some tables.

Nulls in a database can cause a few headaches. Moreover, the descriptions in the SQL standards on how to handle NULLs seem ambiguous. It is not clear from the standards documents exactly how NULLs should be handled in all [circumstances](https://www.sqlite.org/nulls.html).

Sometimes, we actually can avoid NULLs by setting the NOT NULL constrain when we create a table. However, it is worth bearing in mind that making fields NOT NULL does not always work and could create more headaches than it cures. Not all values of null mean there is a problem with the data.

SQLite NULL is the term used to represent a missing value. A NULL value in a table is a value in a field that appears to be blank. However, a NULL value should not simply thought as 0 (zero) or an empty string like ' '. It is a value of as either empty or undefined.

This notebook will present:
- How to DROP a table ***IF EXISTS***
- How to CREATE a new table from an existing table
- How to UPDATE a table with a WHERE condition
- How to COUNT NULL values with IS NULL
- How to give NULLs default values with the SQLite ***COALESCE*** function

In [0]:
%load_ext sql

### 1. Connect to database

It was mentioned before the demo.db3 is extracted from a hydrological modelling. As a result, the data in each table is tidy and complete without NULL values. However, we can create a table with NULL values for demo.

In [0]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the following command to query.

In [0]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. Create a table with NULL values from an existing table

Take the table of watershed_yearly as an example.
- ***Firstly, make a backup table***

>The SQLite CREATE TABLE AS statement is used to create a table from an existing table by copying the existing table's columns.

In [0]:
%%sql sqlite://
DROP TABLE  IF EXISTS watershed_yearly_bk;
CREATE TABLE watershed_yearly_bk AS SELECT * FROM watershed_yearly

Have a quick check of the backup table

In [0]:
%%sql sqlite://
SELECT YR, PREC_mm 
FROM watershed_yearly_bk
---LIMIT 3

- ***Secondly, make some values as NULLs***

>SQLite UPDATE Query is used to modify the existing records in a table. You can use WHERE clause with UPDATE query to update selected rows, otherwise all the rows would be updated.

In [0]:
%%sql sqlite://
UPDATE watershed_yearly_bk
SET PREC_mm = NULL
WHERE
    PREC_mm < 850.0

### 3. Find NULLs

Null values cannot be determined with an =. We need to use the IS NULL or IS NOT NULL statements to identify null values. So, to get all records with no recorded snow_depth, we could run this query.

In [0]:
%%sql sqlite://
SELECT  YR, PREC_mm
FROM watershed_yearly_bk
WHERE PREC_mm IS NULL

The count of years with NULLs

In [0]:
%%sql sqlite://
SELECT  COUNT(YR) AS MISSING
FROM watershed_yearly_bk
WHERE PREC_mm IS NULL

:) It is right the number of rows we updated.

### 4. Handle NULLs

NULLs can be ambiguous and annoying as ther are identified differently depending on data sources. Tale can have NULL values for a number of reasons such as observations that were not recorded and data corruption.

In general, there are two main strategies to handle NULLs during the query session and ***NOT*** to change original data in the table.

#### 4.1  Do nut use rows with NULL values

This strategy is quite simple as we always can filter the data with a ***WHERE IS NOT NULL*** condition. However, in practice, the data would be used at all, if the ratio of NULLs is too high.

In [0]:
%%sql sqlite://
SELECT  YR, PREC_mm
FROM watershed_yearly_bk
WHERE PREC_mm IS NOT NULL

*Calculate the counts of NULLs, NOt_NULLs and total*. Keep in mind that the ***COUNT*** function will neglet NULL values.

In [0]:
%%sql sqlite://
SELECT SUM(CASE WHEN PREC_mm IS NULL THEN 1 else 0 END) COUNT_NULLs,
       COUNT(PREC_mm) COUNT_NOT_NULLs,
       COUNT(YR) AS TOTAL
From watershed_yearly_bk

#### 4.2 Replace NULL values with sensible values***

It is recommended that you should firstly check the database document to make sure that nullable columns (columns that are allowed to have null values) have documented what a null value means from a business perspective before replacing NULL values with sensible values.

The SQLite provides a more elegant way of handling NULL values. Tha is to use the COALESCE() function that accepts two or more arguments and returns the first non-null argument into a specified default value if it is null. If all the arguments are NULL, the COALESCE function returns NULL.

The following illustrates the syntax of the COALESCE function:<br>
*** COALESCE(parameter1, parameter2, …)***;<br>

Here we want all NULLs of PREC_mm to be treated as the climatological mean of NOT NULLs.

***Caluclate the mean nof NON-NULLs***

In [0]:
%%sql sqlite://
SELECT avg(PREC_mm)
From watershed_yearly_bk

***Replace NULLs with the above mean nof NON-NULLs***

In [0]:
%%sql sqlite://
SELECT YR, COALESCE(PREC_mm, 936.122131348) as Precipitation
From watershed_yearly_bk

### Summary

Dealing with NULL values is a complicated task. It would be better to get assistances from domain experts or you know very clearly what the NULL vlaues were presented for.

## ex12-Bonus: Interactive with Pandas

In the previous notebooks, we praticed basic SQL syntax with sql% (SQL magic) just like using a command line tool. In fact, SQL magic has a nice integration with pandas library. Result from SQL query can be converted to regular pandas data frame via DataFrame call. After retrieving data into a Pandas DataFrame, we can do more Exploratory Data Analysis. However, that is another story beyond the scope of SQL itself.

In [0]:
%load_ext sql

### 1. Load all needed libraries

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib

%matplotlib inline

### 2. Read the table of rch in the demo.db3

#### 2.1 Connect database

In [0]:
%sql sqlite:///data/demo.db3

#### 2.2 Save query into a variable

In [0]:
%%sql sqlres << 
SELECT RCH, YR, MO, FLOW_OUTcms 
FROM rch

#### 2.3 Retrieve dataframe from query results

In [0]:
df = sqlres.DataFrame()
df.head()

### 3. Further process with Pandas

#### 3.1 Custom quarters definition

In [0]:
quarters = {1: 'DJF', 2: 'DJF', 3: 'MAM', 4: 'MAM', 5: 'MAM', 6: 'JJA',
            7: 'JJA', 8: 'JJA', 9: 'SON', 10: 'SON', 11: 'SON', 12: 'DJF'}

#### 3.2 Carry out seasonal statistics for each reach

In [0]:
df = df.set_index(['MO'])
ssndf = df.groupby(['RCH',quarters])['FLOW_OUTcms'].mean()
ssndf.head(5)

#### Reset index

In [0]:
ssndf = ssndf.reset_index()
ssndf.set_index(['RCH'])
ssndf.head(5)

In [0]:
ssndf = ssndf.rename(index=str, columns={"level_1":"SSN"})
ssndf.head(5)

#### Convert data into pivoted table

In [0]:
pivoted = ssndf.pivot(index='RCH', columns='SSN', values='FLOW_OUTcms')
pivoted.head()

### 4. Visualize
Set some parameters to make figure pretty

In [0]:
# Plot size to 15" x 7"
matplotlib.rc('figure', figsize = (15, 7))
# Font size to 14
matplotlib.rc('font', size = 14)
# Display top and right frame lines
matplotlib.rc('axes.spines', top = True, right = True)
# Remove grid lines
matplotlib.rc('axes', grid = False)
# Set backgound color to white
matplotlib.rc('axes', facecolor = 'white')

pivoted.plot(kind='bar', title='Seasonal Mean Discharge from 1981 to 2010 ($m^3/s$)')

### Summary


In this tutorial we have seen how easy it is to link a SQLite database operations to Pandas via sql%. Moreover, we use Python tools such as Pandas do more further analysis after retrieving data.

## ex12-Bonus: Interactive with Pandas

In the previous notebooks, we praticed basic SQL syntax with sql% (SQL magic) just like using a command line tool. In fact, SQL magic has a nice integration with pandas library. Result from SQL query can be converted to regular pandas data frame via DataFrame call. After retrieving data into a Pandas DataFrame, we can do more Exploratory Data Analysis. However, that is another story beyond the scope of SQL itself.

In [0]:
%load_ext sql

### 1. Load all needed libraries

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib

%matplotlib inline

### 2. Read the table of rch in the demo.db3

#### 2.1 Connect database

In [0]:
%sql sqlite:///data/demo.db3

#### 2.2 Save query into a variable

In [0]:
%%sql sqlres << 
SELECT RCH, YR, MO, FLOW_OUTcms 
FROM rch

#### 2.3 Retrieve dataframe from query results

In [0]:
df = sqlres.DataFrame()
df.head()

### 3. Further process with Pandas

#### 3.1 Custom quarters definition

In [0]:
quarters = {1: 'DJF', 2: 'DJF', 3: 'MAM', 4: 'MAM', 5: 'MAM', 6: 'JJA',
            7: 'JJA', 8: 'JJA', 9: 'SON', 10: 'SON', 11: 'SON', 12: 'DJF'}

#### 3.2 Carry out seasonal statistics for each reach

In [0]:
df = df.set_index(['MO'])
ssndf = df.groupby(['RCH',quarters])['FLOW_OUTcms'].mean()
ssndf.head(5)

#### Reset index

In [0]:
ssndf = ssndf.reset_index()
ssndf.set_index(['RCH'])
ssndf.head(5)

In [0]:
ssndf = ssndf.rename(index=str, columns={"level_1":"SSN"})
ssndf.head(5)

#### Convert data into pivoted table

In [0]:
pivoted = ssndf.pivot(index='RCH', columns='SSN', values='FLOW_OUTcms')
pivoted.head()

### 4. Visualize
Set some parameters to make figure pretty

In [0]:
# Plot size to 15" x 7"
matplotlib.rc('figure', figsize = (15, 7))
# Font size to 14
matplotlib.rc('font', size = 14)
# Display top and right frame lines
matplotlib.rc('axes.spines', top = True, right = True)
# Remove grid lines
matplotlib.rc('axes', grid = False)
# Set backgound color to white
matplotlib.rc('axes', facecolor = 'white')

pivoted.plot(kind='bar', title='Seasonal Mean Discharge from 1981 to 2010 ($m^3/s$)')

### Summary


In this tutorial we have seen how easy it is to link a SQLite database operations to Pandas via sql%. Moreover, we use Python tools such as Pandas do more further analysis after retrieving data.

## ex13-Using SQLite as a Time Series Database

SQLite supports five ***date*** and ***time*** functions as follows:
1. date(timestring, modifier, modifier, ...)
2. time(timestring, modifier, modifier, ...)
3. datetime(timestring, modifier, modifier, ...)
4. julianday(timestring, modifier, modifier, ...)
5. strftime(format, timestring, modifier, modifier, ...)

All five date and time functions take a time string as an argument. The time string is followed by zero or more modifiers. The strftime() function also takes a format string as its first argument. With these date and time functions, we can save time series data into a SQLite database so as to use SQLite as a time series database.

In this notebook, we will create a table to save man-made temperature data at different dates and times. You can presume that they are collected from some kind of temperature sensors.

This notebook will present:

- Practice date and time functions
- Create a temperature table and index
- Insert data into the temperature table
- Query

In [0]:
%load_ext sql

In [0]:
from random import uniform, choice
import time
from datetime import datetime, timedelta
import pandas as pd
%matplotlib inline

### 1. Connect to database

It was mentioned before the demo.db3 is extracted from a hydrological modelling. As a result, the data in each table is tidy and complete without NULL values. However, we can create a table with NULL values for demo.

In [0]:
%sql sqlite:///data/demo.db3

### 2. Play with date and time functions

You can find more example from [lang_datefunc](https://www.sqlite.org/lang_datefunc.html) or [sqlite_date_time](https://www.tutorialspoint.com/sqlite/sqlite_date_time.htm)

- Compute the current date.

In [0]:
%sql SELECT date('now');

- Compute the last day of the current month.

In [0]:
%sql SELECT date('now','start of month','+1 month','-1 day');

- Compute the date of the first Tuesday in October for the current year.

In [0]:
%sql SELECT date('now','start of year','+9 months','weekday 2');

### 3. Create a table of time series temperature 

#### 3.1 Create table

only with two columns of timestamp and Temperature

In [0]:
%%sql sqlite://
DROP TABLE IF EXISTS Temperature;
CREATE TABLE Temperature (Timestamp DATETIME NOT NULL, Temperature NUMERIC NOT NULL)

#### 3.2 Create an index

For efficient querying, we'll want to index the timestamp column.

In [0]:
%%sql sqlite://
CREATE UNIQUE INDEX idx_timestamp ON Temperature (Timestamp);

#### 3.3 Insert data

Make 500 rows of data and temperature ranges between 18 to 26.

In [0]:
def dt(days):
    return timedelta(days=days)

N_rows = 500
now = datetime.now()

for i in range(N_rows):
    timestamp = now - dt(days=(N_rows - i))
    temperature = uniform(18, 26)
    %sql INSERT INTO Temperature VALUES (:timestamp, :temperature);

### 4. Play with time series table

#### 4.1 Simple Query

In [0]:
%sql SELECT datetime(Timestamp) as Date, Temperature FROM Temperature LIMIT 5

#### 4.2 Filter with a datetime

In [0]:
%%sql sqlite://
SELECT Timestamp as Date, Temperature
FROM Temperature
WHERE Date <= '2017-12-31 14:21:45'

#### 4.3 Query data at a specific year

Use CAST string to integer as strftime returns a string.

In [0]:
%%sql sqlite://
SELECT Timestamp as Date, Temperature 
FROM Temperature
WHERE CAST(strftime('%Y', Date) as Int) = 2017

#### 4.5 Aggregate yearly

In [0]:
%%sql sqlite://
SELECT strftime('%Y', Timestamp) as Year, 
       AVG(Temperature) AS MEAN_TMP,
       MAX(Temperature) AS MAX_TMP,
       MIN(Temperature) AS MIN_TMP
FROM Temperature
GROUP BY strftime('%Y', Timestamp)

### 5. Visualization

Here we convert SQL query results into Pandas DataFrame.

In [0]:
ts = %sql SELECT datetime(Timestamp) as date, Temperature FROM Temperature
df = ts.DataFrame()
df.set_index("date", inplace = True) 
df.index = pd.to_datetime(df.index)
df.index

In [0]:
df.plot(figsize=(12, 6))

### Summary and References

Time series databases (TSDBs) are getting popular these days. There are quite a few [TSDbs](https://en.wikipedia.org/wiki/Time_series_database) such as InfluxDB, Graphite, Druid, Kairos, and Prometheus. With the SQLite date and time functions, we can save time series data into a SQLite database so as to use SQLite as a time series database. 

https://www.sqlite.org/lang_datefunc.html

https://www.tutorialspoint.com/sqlite/sqlite_date_time.htm

## s01-Transaction (Begin, Commit, Rollback)

Generally the SQLite is in auto-commit mode that means SQLite automatically starts a transaction for each command, process and commit the transaction changes automatically to database. However, we still can disable auto-commit mode and use the following three commands to control these transactions to maintain data consistency and to handle database errors based on our requirements:

- BEGIN – start the transaction;
- COMMIT – commit the transaction that means all the changes saved to database;
- ROLLBACK – rollback the complete transaction.

Transactional control commands are only used with commands INSERT, UPDATE, and DELETE. They cannot be used while creating tables or dropping them because these operations are automatically committed in the database.

In this notebook, we will have a test on the command of ***DELETE***, only because we already practiced UPDATE and INSERT before. In addition, we will use the ***[sqlite3](https://docs.python.org/2/library/sqlite3.html)*** package because ipython_sql does not support transactions.

The ***DELETE*** is a very dangerous command so it is better to firstly back up your database before applying it.

In [0]:
import sqlite3 as lite
import sys

### 1. Connect to database

In [0]:
con = lite.connect('data/demo.db3')

### 2. Make a test table

This time, we still use the table of watershed_yearly to make a test table just as we did in the previous notebook.

In [0]:
with con:
    cur = con.cursor() 
    
    sql = """
    DROP TABLE  IF EXISTS watershed_yearly_bk;
    CREATE TABLE watershed_yearly_bk AS SELECT YR, PREC_mm FROM watershed_yearly
    """
    
    cur.executescript(sql)

Make some NULLs

In [0]:
with con:
    cur = con.cursor()
    sql = """
    UPDATE watershed_yearly_bk
    SET PREC_mm = NULL
    WHERE
    PREC_mm < 850.0
    """    
    cur.executescript(sql)

Have a quick view

In [0]:
with con:      
    cur = con.cursor()    
    cur.execute("SELECT * FROM watershed_yearly_bk")

    rows = cur.fetchall()

    for row in rows:
        print row

### 2. ROLLBACK a  DELETE transaction

We'd like to drop/delete all rows with NULL values.

In [0]:
con.isolation_level = None
cur = con.cursor()
cur.execute("BEGIN")
sql = """
      DELETE FROM watershed_yearly_bk WHERE PREC_mm IS NULL
      """
cur = con.execute(sql)
cur.execute("ROLLBACK")

Now check the changes and you can find nothing happend.

In [0]:
cur = con.cursor()    
cur.execute("SELECT * FROM watershed_yearly_bk")

rows = cur.fetchall()

for row in rows:
    print row

### 3. COMMIT a DELETE transaction

In [0]:
cur = con.cursor()
cur.execute("BEGIN")
sql = """
      DELETE FROM watershed_yearly_bk WHERE PREC_mm IS NULL
      """
cur = con.execute(sql)
cur.execute("COMMIT")

Now check the changes and you can find the rows with NULLs have been deleted.

In [0]:
cur = con.cursor()    
cur.execute("SELECT * FROM watershed_yearly_bk")

rows = cur.fetchall()

for row in rows:
    print row

### 4. Close the db connection

In [0]:
con.close()

### Summary and References

Using ***sqlite3*** is not that panic because we can easily wrap the query sentences in the previous notebook into strings. This notebook also show there are other ways accessing SQLite database. If you are intested in it, you can try [SQLAlchemy](https://docs.sqlalchemy.org/en/latest/dialects/sqlite.html), which is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.

https://www.tutorialspoint.com/sqlite/sqlite_transactions.htm

https://www.tutlane.com/tutorial/sqlite/sqlite-transactions-begin-commit-rollback.

http://zetcode.com/db/sqlitepythontutorial/

https://docs.sqlalchemy.org/en/latest/dialects/sqlite.html

https://docs.python.org/3.8/library/sqlite3.html